# Points Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
HermiteFace..::..Points Property
HermiteFace Class See Also
---
Interpolation points of the surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<XYZ> Points { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Points As IList(Of XYZ)
	Get
```

Visual C++
---
```text
public:
property IList<XYZ^>^ Points {
	IList<XYZ^>^ get ();
}
```

# See Also
HermiteFace Class
Autodesk.Revit.DB Namespace